In [9]:
import numpy as np
import pandas as pd
data = [['Anu', 'A', 5.4], ['Anu', 'B', 6.7], ['Anu', 'C', 10.1],['Jenny', 'A', 6.5], ['Jenny', 'B', 5.9], ['Jenny', 'C', 12.2],['Tom', 'A', 4.0], ['Tom', 'B', None], ['Tom', 'C', 9.5]]

In [10]:
print(data, end='')

[['Anu', 'A', 5.4], ['Anu', 'B', 6.7], ['Anu', 'C', 10.1], ['Jenny', 'A', 6.5], ['Jenny', 'B', 5.9], ['Jenny', 'C', 12.2], ['Tom', 'A', 4.0], ['Tom', 'B', None], ['Tom', 'C', 9.5]]

In [12]:
df = pd.DataFrame(data , columns=['Student', 'Compound', 'Yield /g'])
df

  Student Compound  Yield /g
0     Anu        A       5.4
1     Anu        B       6.7
2     Anu        C      10.1
3   Jenny        A       6.5
4   Jenny        B       5.9
5   Jenny        C      12.2
6     Tom        A       4.0
7     Tom        B       NaN
8     Tom        C       9.5

In [16]:
grouped = df.groupby('Compound')
list(grouped)

[('A',
    Student Compound  Yield /g
  0     Anu        A       5.4
  3   Jenny        A       6.5
  6     Tom        A       4.0),
 ('B',
    Student Compound  Yield /g
  1     Anu        B       6.7
  4   Jenny        B       5.9
  7     Tom        B       NaN),
 ('C',
    Student Compound  Yield /g
  2     Anu        C      10.1
  5   Jenny        C      12.2
  8     Tom        C       9.5)]

In [19]:
grouped.mean()

C:\Users\Rabo Yusuf\AppData\Local\Temp\ipykernel_5384\3907159713.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped.mean()

          Yield /g
Compound
A              5.3
B              6.3
C             10.6

In [20]:
grouped.max()

         Student  Yield /g
Compound
A            Tom       6.5
B            Tom       6.7
C            Tom      12.2

In [21]:
grouped.min()

         Student  Yield /g
Compound
A            Anu       4.0
B            Anu       5.9
C            Anu       9.5

### The object returned by groupby() can be iterated over:

In [22]:
for compound , group in grouped:
    print('Compound:', compound)
    print(group)

Compound: A
  Student Compound  Yield /g
0     Anu        A       5.4
3   Jenny        A       6.5
6     Tom        A       4.0
Compound: B
  Student Compound  Yield /g
1     Anu        B       6.7
4   Jenny        B       5.9
7     Tom        B       NaN
Compound: C
  Student Compound  Yield /g
2     Anu        C      10.1
5   Jenny        C      12.2
8     Tom        C       9.5